espressif/esp-idf/components/soc/esp32c2/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_CPU_INT_PRI_2_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_2_REG (DR_REG_INTERRUPT_BASE + 0xd0)
/** INTERRUPT_CORE0_CPU_PRI_2_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_2_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_M  (INTERRUPT_CORE0_CPU_PRI_2_MAP_V << INTERRUPT_CORE0_CPU_PRI_2_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_3_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_3_REG (DR_REG_INTERRUPT_BASE + 0xd4)
/** INTERRUPT_CORE0_CPU_PRI_3_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_3_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_M  (INTERRUPT_CORE0_CPU_PRI_3_MAP_V << INTERRUPT_CORE0_CPU_PRI_3_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_4_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_4_REG (DR_REG_INTERRUPT_BASE + 0xd8)
/** INTERRUPT_CORE0_CPU_PRI_4_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_4_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_M  (INTERRUPT_CORE0_CPU_PRI_4_MAP_V << INTERRUPT_CORE0_CPU_PRI_4_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_5_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_5_REG (DR_REG_INTERRUPT_BASE + 0xdc)
/** INTERRUPT_CORE0_CPU_PRI_5_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_5_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_5_MAP_M  (INTERRUPT_CORE0_CPU_PRI_5_MAP_V << INTERRUPT_CORE0_CPU_PRI_5_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_5_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_5_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_6_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_6_REG (DR_REG_INTERRUPT_BASE + 0xe0)
/** INTERRUPT_CORE0_CPU_PRI_6_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_6_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_6_MAP_M  (INTERRUPT_CORE0_CPU_PRI_6_MAP_V << INTERRUPT_CORE0_CPU_PRI_6_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_6_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_6_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_7_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_7_REG (DR_REG_INTERRUPT_BASE + 0xe4)
/** INTERRUPT_CORE0_CPU_PRI_7_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_7_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_7_MAP_M  (INTERRUPT_CORE0_CPU_PRI_7_MAP_V << INTERRUPT_CORE0_CPU_PRI_7_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_7_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_7_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_8_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_8_REG (DR_REG_INTERRUPT_BASE + 0xe8)
/** INTERRUPT_CORE0_CPU_PRI_8_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_8_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_8_MAP_M  (INTERRUPT_CORE0_CPU_PRI_8_MAP_V << INTERRUPT_CORE0_CPU_PRI_8_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_8_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_8_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_9_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_9_REG (DR_REG_INTERRUPT_BASE + 0xec)
/** INTERRUPT_CORE0_CPU_PRI_9_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_9_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_9_MAP_M  (INTERRUPT_CORE0_CPU_PRI_9_MAP_V << INTERRUPT_CORE0_CPU_PRI_9_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_9_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_9_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_10_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_10_REG (DR_REG_INTERRUPT_BASE + 0xf0)
/** INTERRUPT_CORE0_CPU_PRI_10_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_10_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_10_MAP_M  (INTERRUPT_CORE0_CPU_PRI_10_MAP_V << INTERRUPT_CORE0_CPU_PRI_10_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_10_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_10_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_11_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_11_REG (DR_REG_INTERRUPT_BASE + 0xf4)
/** INTERRUPT_CORE0_CPU_PRI_11_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_11_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_11_MAP_M  (INTERRUPT_CORE0_CPU_PRI_11_MAP_V << INTERRUPT_CORE0_CPU_PRI_11_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_11_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_11_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_12_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_12_REG (DR_REG_INTERRUPT_BASE + 0xf8)
/** INTERRUPT_CORE0_CPU_PRI_12_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_12_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_12_MAP_M  (INTERRUPT_CORE0_CPU_PRI_12_MAP_V << INTERRUPT_CORE0_CPU_PRI_12_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_12_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_12_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_13_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_13_REG (DR_REG_INTERRUPT_BASE + 0xfc)
/** INTERRUPT_CORE0_CPU_PRI_13_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_13_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_13_MAP_M  (INTERRUPT_CORE0_CPU_PRI_13_MAP_V << INTERRUPT_CORE0_CPU_PRI_13_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_13_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_13_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_14_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_14_REG (DR_REG_INTERRUPT_BASE + 0x100)
/** INTERRUPT_CORE0_CPU_PRI_14_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_14_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_14_MAP_M  (INTERRUPT_CORE0_CPU_PRI_14_MAP_V << INTERRUPT_CORE0_CPU_PRI_14_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_14_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_14_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_15_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_15_REG (DR_REG_INTERRUPT_BASE + 0x104)
/** INTERRUPT_CORE0_CPU_PRI_15_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_15_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_15_MAP_M  (INTERRUPT_CORE0_CPU_PRI_15_MAP_V << INTERRUPT_CORE0_CPU_PRI_15_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_15_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_15_MAP_S  0

